app/views/venues/_venues_list.html.erb

		<p><%= venue[:address].gsub(",",", ") %> |
			<% if current_user.favorite_venue_ids.include?(venue.id) %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 2