app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "updated_at", "user_id", "venue_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 26 Sep 2013 15:49:55 UTC +00:00], ["updated_at", Thu, 26 Sep 2013 15:49:55 UTC +00:00], ["user_id", nil], ["venue_id", nil]]
---
	def new
		venue_id = params[:id]

		Favorite.create(venue_id: venue_id, user_id: current_user.id)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."venue_id" = 44
SELECT "favorites".* FROM "favorites" WHERE "favorites"."venue_id" = 44 AND "favorites"."user_id" = 2
---
	def delete
		venue_id = params[:id]

		favorite_one = Favorite.where(venue_id: venue_id)
		favorite = favorite_one.where(user_id: current_user.id)