app/controllers/venues_controller.rb

	def main
		venues = Venue.all
			venues.each do |venue|
				client = Foursquare2::Client.new(:client_id => "RALB0H3NYUUPGDF501WRSNB55UWHTQKDLISKHJ5JC2WX3KBM", :client_secret => "JR4DPIZZ3LP1BZMI2AYZR3UWAYX2CXHF0PWA3Y24RDIRVNBW")
				herenow = client.herenow(venue.venue_id)
				venue.here_now = herenow.hereNow["count"]
				venue.save
			end
		@venues = Venue.order("here_now DESC").limit(5)
---
SELECT "venues".* FROM "venues" ORDER BY here_now DESC LIMIT 5

	def maintips

		@venues = Venue.order("here_now DESC").limit(5)

		venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" ORDER BY here_now DESC LIMIT 5
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT 1  [["id", "19"]]

	def map
		@venues = Venue.order("here_now DESC").limit(5)
---
SELECT "venues".* FROM "venues" ORDER BY here_now DESC LIMIT 5